In [1]:
import pandas as pd

In [2]:
movies = pd.read_csv('ml-1m/movies.dat', encoding='latin-1', sep="::", header=None)

C:\Users\asus\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [3]:
movies.shape

(3883, 3)

In [4]:
movies.head()

   0                                   1                             2
0  1                    Toy Story (1995)   Animation|Children's|Comedy
1  2                      Jumanji (1995)  Adventure|Children's|Fantasy
2  3             Grumpier Old Men (1995)                Comedy|Romance
3  4            Waiting to Exhale (1995)                  Comedy|Drama
4  5  Father of the Bride Part II (1995)                        Comedy

In [5]:
movies.columns = ['movie_id','movie_name','movie_category']

In [6]:
movies.head()

   movie_id                          movie_name                movie_category
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [7]:
# ratings = pd.read_csv('ml-1m/ratings.dat',encoding='latin-1', sep="::", header=None)
ratings = pd.read_csv('ml-1m/ratings.csv', header=None)

In [8]:
ratings.shape

(1000209, 4)

In [9]:
ratings.head()

   0     1  2          3
0  1  1193  5  978300760
1  1   661  3  978302109
2  1   914  3  978301968
3  1  3408  4  978300275
4  1  2355  5  978824291

In [10]:
ratings.columns = ['user_id','movie_id','rating','timestamp']

In [11]:
users = pd.read_csv('ml-1m/users.dat',encoding='latin-1', sep="::", header=None)

C:\Users\asus\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [12]:
users.shape

(6040, 5)

In [13]:
users.head()

   0  1   2   3      4
0  1  F   1  10  48067
1  2  M  56  16  70072
2  3  M  25  15  55117
3  4  M  45   7  02460
4  5  M  25  20  55455

In [14]:
user_1 = ratings[ratings['user_id'] == 1]
user_2 = ratings[ratings['user_id'] == 2]

In [15]:
# data = [user_1, user_2]
# df = pd.DataFrame(data)

In [16]:
user_1.head()

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [17]:
len(user_1), len(user_2), len(ratings)

(53, 129, 1000209)

In [18]:
user_1_rated = ratings[(ratings['user_id'] == 1) & (ratings['rating'] == 5)]

In [19]:
user_2_rated = ratings[(ratings['user_id'] == 2) & (ratings['rating'] == 5)]

In [20]:
movie_id = []

In [21]:
m1 = user_1_rated['movie_id']
m2 = user_2_rated['movie_id']

In [22]:
len(m2)

34

In [23]:
m1,m2 = set(m1), set(m2)

In [24]:
output = m1.intersection(m2)

In [25]:
len(m1), len(m2)

(18, 34)

In [29]:
movies[movies['movie_id'] == list(output)[0]]

      movie_id                              movie_name movie_category
1176      1193  One Flew Over the Cuckoo's Nest (1975)          Drama